Infineon/mtb-example-psoc-edge-btstack-findme/proj_cm33_ns/source/main.c
/*******************************************************************************
* File Name: main.c
*
* Description: This source file contains the main routine for non-secure
*              application in the CM33 CPU for the BLE Find Me Example
*              for ModusToolbox.
*
* Related Document: See README.md
*
********************************************************************************
* Copyright 2023-2025, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/
#include "wiced_bt_stack.h"
#include "cyabs_rtos_impl.h"
#include <FreeRTOS.h>
#include <task.h>
#include <queue.h>
#include <string.h>
#include "cybt_platform_trace.h"
#include "wiced_memory.h"
#include "stdio.h"
#include "cycfg_gatt_db.h"
#include "cycfg_bt_settings.h"
#include "cycfg_gap.h"
#include "wiced_bt_dev.h"
#include "cybsp_bt_config.h"
#include "retarget_io_init.h"
#include "app_bt_utils.h"
#include "cy_time.h"

/*******************************************************************************
* Macros
*******************************************************************************/
/* IAS Alert Levels */
#define IAS_ALERT_LEVEL_LOW                  (0U)
#define IAS_ALERT_LEVEL_MID                  (1U)
#define IAS_ALERT_LEVEL_HIGH                 (2U)

/* App boot address for CM55 project */
#define CM55_APP_BOOT_ADDR                   (CYMEM_CM33_0_m55_nvm_START + \
                                              CYBSP_MCUBOOT_HEADER_SIZE)

/* The timeout value in microseconds used to wait for CM55 core to be booted */
#define CM55_BOOT_WAIT_TIME_USEC             (10U)
#define SCAN_RESPONSE_NO_OF_ELEMENTS         (1U)

/* Enabling or disabling a MCWDT requires a wait time of upto 2 CLK_LF cycles
 * to come into effect. This wait time value will depend on the actual CLK_LF
 * frequency set by the BSP
 */
#define LPTIMER_0_WAIT_TIME_USEC             (62U)

/* Define the LPTimer interrupt priority number. '1' implies highest priority */
#define APP_LPTIMER_INTERRUPT_PRIORITY       (1U)
#define CONNECTION_ID_INIT_VALUE             (0U)
#define IAS_ALERT_LEVEL_INDEX                (0U)
#define DUTY_CYCLE_ZERO                      (0U)
#define DUTY_CYCLE_FIFTY                     (5000U)
#define DUTY_CYCLE_HUNDRED                   (10000U)
#define EXT_ATTR_INIT_VAL                    (0U)
#define CONN_ID_INIT_VAL                     (0U)
#define HANDLE_INIT_VAL                      (0U)
#define LENGTH_INIT_VAL                      (0U)
#define NOT_FILLED                           (0U)
#define BDA_INIT_VAL                         (0U)

/*******************************************************************************
* Variable Definitions
*******************************************************************************/
/* RTC HAL object */
mtb_hal_rtc_t rtc_obj;

/* This enumeration combines the advertising, connection states from two different
 * callbacks to maintain the status in a single state variable
 */
typedef enum
{
    APP_BT_ADV_OFF_CONN_OFF,
    APP_BT_ADV_ON_CONN_OFF,
    APP_BT_ADV_OFF_CONN_ON
} app_bt_adv_conn_mode_t;

static uint16_t                  bt_connection_id = CONNECTION_ID_INIT_VALUE;
static app_bt_adv_conn_mode_t    app_bt_adv_conn_state = APP_BT_ADV_OFF_CONN_OFF;

/* LPTimer HAL object */
static mtb_hal_lptimer_t lptimer_obj;

#if (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP)

/* PWM_1 Context for SysPm Callback */
mtb_syspm_tcpwm_deepsleep_context_t PWM1dscontext =
{
    .channelNum = CYBSP_PWM_LED_CTRL_1_NUM,
};

/* PWM_2 Context for SysPm Callback */
mtb_syspm_tcpwm_deepsleep_context_t PWM2dscontext =
{
    .channelNum = CYBSP_PWM_LED_CTRL_2_NUM,
};

/* SysPm callback parameter structure for PWM_1 */
static cy_stc_syspm_callback_params_t PWM1DSParams =
{
        .context   = &PWM1dscontext,
        .base      = CYBSP_PWM_LED_CTRL_1_HW
};

/* SysPm callback parameter structure for PWM_2 */
static cy_stc_syspm_callback_params_t PWM2DSParams =
{
        .context   = &PWM2dscontext,
        .base      = CYBSP_PWM_LED_CTRL_2_HW
};

/* SysPm callback structure for PWM_1 */
static cy_stc_syspm_callback_t PWM1DeepSleepCallbackHandler =
{
    .callback           = &mtb_syspm_tcpwm_deepsleep_callback,
    .skipMode           = CY_SYSPM_SKIP_CHECK_FAIL | CY_SYSPM_SKIP_CHECK_READY,
    .type               = CY_SYSPM_DEEPSLEEP,
    .callbackParams     = &PWM1DSParams,
    .prevItm            = NULL,
    .nextItm            = NULL,
    .order              = SYSPM_CALLBACK_ORDER
};

