Infineon/mtb-example-psoc-edge-btstack-findme/proj_cm33_ns/source/main.c
/* SysPm callback structure for PWM_2 */
static cy_stc_syspm_callback_t PWM2DeepSleepCallbackHandler =
{
    .callback           = &mtb_syspm_tcpwm_deepsleep_callback,
    .skipMode           = CY_SYSPM_SKIP_CHECK_FAIL | CY_SYSPM_SKIP_CHECK_READY,
    .type               = CY_SYSPM_DEEPSLEEP,
    .callbackParams     = &PWM2DSParams,
    .prevItm            = NULL,
    .nextItm            = NULL,
    .order              = SYSPM_CALLBACK_ORDER
};

#endif /*CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP) */


/*******************************************************************************
* Function Prototypes
********************************************************************************/
typedef void (*pfn_free_buffer_t)(uint8_t *);
wiced_bt_dev_status_t wiced_bt_ble_set_raw_scan_response_data
(uint8_t num_elem, wiced_bt_ble_advert_elem_t *p_data);

/*******************************************************************************
* Function Definitions
*******************************************************************************/

/*******************************************************************************
* Function Name: ias_led_update
********************************************************************************
* Summary:
*   This function updates the IAS alert level LED state based on LE
*   advertising/connection state.
*******************************************************************************/
static void ias_led_update(void)
{
    /* Update LED based on IAS alert level only when the device is connected */
    if(APP_BT_ADV_OFF_CONN_ON == app_bt_adv_conn_state)
    {
        /* Update LED state based on IAS alert level. LED OFF for low level,
         * LED blinking for mid level, and LED ON for high level
         */
        switch(app_ias_alert_level[IAS_ALERT_LEVEL_INDEX])
        {
            case IAS_ALERT_LEVEL_LOW:
                Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_2_HW,
                        CYBSP_PWM_LED_CTRL_2_NUM,DUTY_CYCLE_ZERO);
                break;

            case IAS_ALERT_LEVEL_MID:
                Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_2_HW,
                        CYBSP_PWM_LED_CTRL_2_NUM,DUTY_CYCLE_FIFTY);
                break;

            case IAS_ALERT_LEVEL_HIGH:
                Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_2_HW,
                        CYBSP_PWM_LED_CTRL_2_NUM,DUTY_CYCLE_HUNDRED);
                break;

            default:
                /* Consider any other level as High alert level */
                Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_2_HW,
                        CYBSP_PWM_LED_CTRL_2_NUM,DUTY_CYCLE_HUNDRED);
                break;
        }
    }
    else
    {
        /* In case of disconnection, turn off the IAS LED */
        Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_2_HW,
                CYBSP_PWM_LED_CTRL_2_NUM,DUTY_CYCLE_ZERO);
    }
}

/*******************************************************************************
* Function Name: le_app_set_value
********************************************************************************
* Summary:
*   This function handles writing to the attribute handle in the GATT database
*   using the data passed from the BT stack. The value to write is stored in a
*   buffer whose starting address is passed as one of the function parameters
*
* Parameters:
*  attr_handle - GATT attribute handle
*  p_val       - Pointer to LE GATT write request value
*  len         - length of GATT write request
*
* Return:
*   wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
*                           in wiced_bt_gatt.h
*
*********************************************************************************/
static wiced_bt_gatt_status_t le_app_set_value(uint16_t attr_handle,
                                                uint8_t *p_val,
                                                uint16_t len)
{
    wiced_bool_t isHandleInTable = WICED_FALSE;
    wiced_bool_t validLen = WICED_FALSE;
    wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_INVALID_HANDLE;

    /* Check for a matching handle entry */
    for (int i = EXT_ATTR_INIT_VAL; i < app_gatt_db_ext_attr_tbl_size; i++)
    {
        if (app_gatt_db_ext_attr_tbl[i].handle == attr_handle)
        {
            /* Detected a matching handle in external lookup table */
            isHandleInTable = WICED_TRUE;

            /* Check if the buffer has space to store the data */
            validLen = (app_gatt_db_ext_attr_tbl[i].max_len >= len);
            if (validLen)
            {
                /* Value fits within the supplied buffer; copy over the value */
                app_gatt_db_ext_attr_tbl[i].cur_len = len;
                memcpy(app_gatt_db_ext_attr_tbl[i].p_data, p_val, len);
                gatt_status = WICED_BT_GATT_SUCCESS;

                /* Add code for any action required when this attribute is written.
                 * In this case, we update the IAS led based on the IAS alert
                 * level characteristic value
                 */

                switch ( attr_handle )
                {
                    case HDLC_IAS_ALERT_LEVEL_VALUE:
                        printf("Alert Level = %d\n",
                                app_ias_alert_level[IAS_ALERT_LEVEL_INDEX]);
                        ias_led_update();
                        break;

                    /* The application is not going to change its GATT DB,
                     * So this case is not handled
                     */
                    case HDLD_GATT_SERVICE_CHANGED_CLIENT_CHAR_CONFIG:
                        gatt_status = WICED_BT_GATT_SUCCESS;
                        break;
                }
            }
            else
            {
                /* Value to write does not meet size constraints */
                gatt_status = WICED_BT_GATT_INVALID_ATTR_LEN;
            }

            break;
        }
    }
    if (!isHandleInTable)
    {
        switch ( attr_handle )
        {
            default:
                /* The write operation was not performed for the indicated handle */
                printf("Write Request to Invalid Handle: 0x%x\n", attr_handle);
                gatt_status = WICED_BT_GATT_WRITE_NOT_PERMIT;
                break;
        }
    }

    return gatt_status;
}

