Infineon/mtb-example-psoc-edge-btstack-findme/proj_cm33_ns/source/main.c
/*******************************************************************************
* Function Name: adv_led_update
********************************************************************************
* Summary:
*  This function updates the advertising LED state based on LE advertising/
*  connection state.
*******************************************************************************/
void adv_led_update(void)
{
    /* Update LED state based on LE advertising/connection state.
     * LED OFF for no advertisement/connection, LED blinking for advertisement
     * state, and LED ON for connected state
     */
    switch(app_bt_adv_conn_state)
    {
        case APP_BT_ADV_OFF_CONN_OFF:
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_1_HW,
                    CYBSP_PWM_LED_CTRL_1_NUM,DUTY_CYCLE_ZERO);
            break;

        case APP_BT_ADV_ON_CONN_OFF:
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_1_HW,
                    CYBSP_PWM_LED_CTRL_1_NUM,DUTY_CYCLE_FIFTY);
            break;

        case APP_BT_ADV_OFF_CONN_ON:
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_1_HW,
                    CYBSP_PWM_LED_CTRL_1_NUM,DUTY_CYCLE_HUNDRED);
            break;

        default:
            /* LED OFF for unexpected states */
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_LED_CTRL_1_HW,
                    CYBSP_PWM_LED_CTRL_1_NUM,DUTY_CYCLE_ZERO);
            break;
    }
}

/*******************************************************************************
* Function Name: le_app_write_handler
********************************************************************************
* Summary:
*   This function handles Write Requests received from the client device
*
* Parameters:
*  conn_id          Connection ID
*  opcode           LE GATT request type opcode
*  p_write_req      Pointer to LE GATT write request
*  len_req          Length of data requested
*  *p_error_handle  Pointer to error handle
*
* Return:
*  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
*  in wiced_bt_gatt.h
*
********************************************************************************/
static wiced_bt_gatt_status_t le_app_write_handler(uint16_t conn_id,
        wiced_bt_gatt_opcode_t opcode, wiced_bt_gatt_write_req_t *p_write_req,
        uint16_t len_req, uint16_t *p_error_handle)
{
    wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_INVALID_HANDLE;
    *p_error_handle = p_write_req->handle;

    /* Attempt to perform the Write Request */
    gatt_status = le_app_set_value(p_write_req->handle, p_write_req->p_val,
                               p_write_req->val_len);
    if( WICED_BT_GATT_SUCCESS != gatt_status )
    {
        printf("WARNING: GATT set attr status 0x%x\n", gatt_status);
    }
    else
    {
        if(GATT_REQ_WRITE == opcode)
        {
            wiced_bt_gatt_server_send_write_rsp(conn_id, opcode,
                    p_write_req->handle);
        }
    }

    return (gatt_status);
}

/*******************************************************************************
* Function Name : le_app_find_by_handle
* ******************************************************************************
* Summary :
*  Find attribute description by handle
*
* Parameter:
*  handle - handle to look up
*
* Return:
*  gatt_db_lookup_table_t - pointer containing handle data
*
*******************************************************************************/
static gatt_db_lookup_table_t  *le_app_find_by_handle(uint16_t handle)
{
    int i;
    for (i = EXT_ATTR_INIT_VAL; i < app_gatt_db_ext_attr_tbl_size; i++)
    {
        if (handle == app_gatt_db_ext_attr_tbl[i].handle )
        {
            break;
        }
    }

    return (&app_gatt_db_ext_attr_tbl[i]);
}

/*******************************************************************************
* Function Name: le_app_read_handler
********************************************************************************
* Summary:
*   This function handles Read Requests received from the client device
*
* Parameters:
*  conn_id          Connection ID
*  opcode           LE GATT request type opcode
*  p_read_req       Pointer to read request containing the handle to read
*  len_req          Length of data requested
*  *p_error_handle  Pointer to error handle
*
* Return:
*  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
*  in wiced_bt_gatt.h
*
*******************************************************************************/
static wiced_bt_gatt_status_t le_app_read_handler( uint16_t conn_id,
             wiced_bt_gatt_opcode_t opcode, wiced_bt_gatt_read_t *p_read_req,
             uint16_t len_req, uint16_t *p_error_handle)
{
    gatt_db_lookup_table_t *puAttribute;
    int  attr_len_to_copy;
    uint8_t *from;
    int to_send;
    wiced_bt_gatt_status_t status = WICED_BT_GATT_SUCCESS;

    *p_error_handle = p_read_req->handle;
    puAttribute = le_app_find_by_handle(p_read_req->handle);
    if ( NULL == puAttribute )
    {
        status = WICED_BT_GATT_INVALID_HANDLE;
    }
    else
    {
        attr_len_to_copy = puAttribute->cur_len;
        if (p_read_req->offset >= puAttribute->cur_len)
        {
            status = WICED_BT_GATT_INVALID_OFFSET;
        }
        else
        {
            to_send = MIN(len_req, attr_len_to_copy - p_read_req->offset);
            from = ((uint8_t *)puAttribute->p_data) + p_read_req->offset;
            status = wiced_bt_gatt_server_send_read_handle_rsp(conn_id, opcode,
                    to_send, from, NULL);
        }
    }

    return status;
}

/*******************************************************************************
* Function Name: le_app_connect_handler
********************************************************************************
* Summary:
*  This callback function handles connection status changes.
*
* Parameters:
*  wiced_bt_gatt_connection_status_t *p_conn_status  : Pointer to data that has
*                                                       connection details
*
* Return:
*  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
*                          in wiced_bt_gatt.h
*
*******************************************************************************/
static wiced_bt_gatt_status_t le_app_connect_handler
             (wiced_bt_gatt_connection_status_t *p_conn_status)
{
    wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_SUCCESS ;
    if ( NULL != p_conn_status )
    {
        if ( p_conn_status->connected )
        {
            /* Device has connected */
            printf("Connected : BDA " );
            print_bd_address(p_conn_status->bd_addr);
            printf("Connection ID '%d' \n", p_conn_status->conn_id );

            /* Store the connection ID */
            bt_connection_id = p_conn_status->conn_id;

            /* Update the adv/conn state */
            app_bt_adv_conn_state = APP_BT_ADV_OFF_CONN_ON;
        }
        else
        {
            /* Device has disconnected */
            printf("Disconnected : BDA " );
            print_bd_address(p_conn_status->bd_addr);
            printf("Connection ID '%d', Reason '%s'\n", p_conn_status->conn_id,
                    get_bt_gatt_disconn_reason_name(p_conn_status->reason) );

            /* Set the connection id to zero to indicate disconnected state */
            bt_connection_id = CONN_ID_INIT_VAL;

            /* Restart the advertisements */
            wiced_bt_start_advertisements(BTM_BLE_ADVERT_UNDIRECTED_HIGH,
                    BLE_ADDR_PUBLIC, NULL);

            /* Update the adv/conn state */
            app_bt_adv_conn_state = APP_BT_ADV_ON_CONN_OFF;

            /* Turn Off the IAS LED on a disconnection */
            ias_led_update();
        }

        /* Update Advertisement LED to reflect the updated state */
        adv_led_update();
        gatt_status = WICED_BT_GATT_ERROR;
    }

    return gatt_status;
}

