Infineon/mtb-example-psoc-edge-btstack-findme/proj_cm33_ns/source/main.c
/*******************************************************************************
* Function Name: app_free_buffer
********************************************************************************
* Summary:
*  This function frees up the memory buffer.
*
* Parameters:
*  uint8_t *p_data: Pointer to the buffer to be free
*
* Return:
*  None
*******************************************************************************/
static void app_free_buffer(uint8_t *p_buf)
{
    vPortFree(p_buf);
}

/*******************************************************************************
* Function Name: app_alloc_buffer
********************************************************************************
* Summary:
*  This function allocates a memory buffer.
*
* Parameters:
*  int len: Length to allocate
*
* Return:
*  None
*******************************************************************************/
static void* app_alloc_buffer(int len)
{
    return pvPortMalloc(len);
}

/*******************************************************************************
* Function Name: app_bt_gatt_req_read_by_type_handler
********************************************************************************
* Function Description:
*  Process read-by-type request from peer device
*
* Parameters:
*  conn_id          Connection ID
*  opcode           LE GATT request type opcode
*  p_read_req       Pointer to read request containing the handle to read
*  len_requested    Length of data requested
*  *p_error_handle  Pointer to error handle
*
* Return:
*  wiced_bt_gatt_status_t  LE GATT status
*
*******************************************************************************/
static wiced_bt_gatt_status_t
app_bt_gatt_req_read_by_type_handler(uint16_t conn_id,
                                     wiced_bt_gatt_opcode_t opcode,
                                     wiced_bt_gatt_read_by_type_t *p_read_req,
                                     uint16_t len_requested,
                                     uint16_t *p_error_handle)
{
    gatt_db_lookup_table_t *puAttribute;
    uint16_t last_handle = HANDLE_INIT_VAL;
    uint16_t attr_handle = p_read_req->s_handle;
    uint8_t *p_rsp = app_alloc_buffer(len_requested);
    uint8_t pair_len = LENGTH_INIT_VAL;
    int used_len = LENGTH_INIT_VAL;
    wiced_bt_gatt_status_t status = WICED_BT_GATT_SUCCESS;
    if (NULL == p_rsp)
    {
        printf("No memory, len_requested: %d!!\r\n",len_requested);
        status = WICED_BT_GATT_INSUF_RESOURCE;
    }
    else
    {
        /* Read by type returns all attributes of the specified type,
         * between the start and end handles
         */
        while (WICED_TRUE)
        {
            *p_error_handle = attr_handle;
            last_handle = attr_handle;
            attr_handle = wiced_bt_gatt_find_handle_by_type(attr_handle,
                                                            p_read_req->e_handle,
                                                           &p_read_req->uuid);
            if (HANDLE_INIT_VAL == attr_handle )
                break;
            if ( NULL == (puAttribute = le_app_find_by_handle(attr_handle)))
            {
                printf("found type but no attribute for %d \r\n",last_handle);
                status = WICED_BT_GATT_INVALID_HANDLE;
                break;
            }
            int filled = wiced_bt_gatt_put_read_by_type_rsp_in_stream(p_rsp +
                         used_len, len_requested - used_len, &pair_len,
                         attr_handle, puAttribute->cur_len, puAttribute->p_data);
            if (NOT_FILLED == filled)
            {
                break;
            }
            used_len += filled;

            /* Increment starting handle for next search to one past current */
            attr_handle++;
        }

        if (LENGTH_INIT_VAL == used_len)
        {
           printf("attr not found  start_handle: 0x%04x  end_handle: 0x%04x  "
                   "Type: 0x%04x\r\n", p_read_req->s_handle, p_read_req->e_handle,
                   p_read_req->uuid.uu.uuid16);
            status = WICED_BT_GATT_INVALID_HANDLE;
        }
        else
        {
            /* Send the response */
            status = wiced_bt_gatt_server_send_read_by_type_rsp(conn_id,
                    opcode, pair_len, used_len, p_rsp, (void *)app_free_buffer);
        }
    }
    if (p_rsp != NULL)
    {
        app_free_buffer(p_rsp);
    }

    return status;
}

/*******************************************************************************
* Function Name: le_app_server_handler
********************************************************************************
* Summary:
*   This function handles GATT server events from the BT stack.
*
* Parameters:
*  p_attr_req:      Pointer to LE GATT connection status
*  *p_error_handle  Pointer to error handle
*
* Return:
*  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
*                          in wiced_bt_gatt.h
*
********************************************************************************/
static wiced_bt_gatt_status_t le_app_server_handler
                  (wiced_bt_gatt_attribute_request_t *p_attr_req,
                   uint16_t *p_error_handle)
{
    wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_SUCCESS;
    switch ( p_attr_req->opcode )
    {
        case GATT_REQ_READ:
        case GATT_REQ_READ_BLOB:

             /* Attribute read request */
            gatt_status = le_app_read_handler(p_attr_req->conn_id,
                                              p_attr_req->opcode,
                                              &p_attr_req->data.read_req,
                                              p_attr_req->len_requested,
                                              p_error_handle);
             break;
        case GATT_REQ_WRITE:
        case GATT_CMD_WRITE:

             /* Attribute write request */
            gatt_status = le_app_write_handler(p_attr_req->conn_id,
                                               p_attr_req->opcode,
                                               &p_attr_req->data.write_req,
                                               p_attr_req->len_requested,
                                               p_error_handle );

             break;
        case GATT_REQ_MTU:
            gatt_status = wiced_bt_gatt_server_send_mtu_rsp(p_attr_req->conn_id,
                                                       p_attr_req->data.remote_mtu,
                                                       CY_BT_RX_PDU_SIZE);
             break;
        case GATT_HANDLE_VALUE_NOTIF:
                    printf("Notfication send complete\n");
             break;
        case GATT_REQ_READ_BY_TYPE:
            gatt_status = app_bt_gatt_req_read_by_type_handler(p_attr_req->conn_id,
                            p_attr_req->opcode, &p_attr_req->data.read_by_type,
                            p_attr_req->len_requested, p_error_handle);
             break;

        default:
                printf("ERROR: Unhandled GATT Connection Request case: %d\n",
                        p_attr_req->opcode);
                gatt_status = WICED_BT_GATT_ERROR;
                break;
    }

    return gatt_status;
}

