Infineon/mtb-example-psoc-edge-btstack-findme/proj_cm33_ns/source/main.c
/******************************************************************************
* Function Name: le_app_gatt_event_callback
*******************************************************************************
* Summary:
*   This function handles GATT events from the BT stack.
*
* Parameters:
*   wiced_bt_gatt_evt_t event                : LE GATT event code of one byte
*                                              length
*   wiced_bt_gatt_event_data_t *p_event_data : Pointer to LE GATT event structures
*
* Return:
*  wiced_bt_gatt_status_t: See possible status codes in wiced_bt_gatt_status_e
*                          in wiced_bt_gatt.h
*
*******************************************************************************/
static wiced_bt_gatt_status_t le_app_gatt_event_callback
            (wiced_bt_gatt_evt_t event, wiced_bt_gatt_event_data_t *p_event_data)
{
    wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_SUCCESS;
    wiced_bt_gatt_attribute_request_t *p_attr_req =
            &p_event_data->attribute_request;
    uint16_t error_handle = HANDLE_INIT_VAL;

    /* Call the appropriate callback function based on the GATT event type,
     * and pass the relevant event
     * parameters to the callback function
     */
    switch ( event )
    {
        case GATT_CONNECTION_STATUS_EVT:
            gatt_status = le_app_connect_handler(&p_event_data->connection_status);
            break;

        case GATT_ATTRIBUTE_REQUEST_EVT:
            gatt_status = le_app_server_handler(p_attr_req,
                                                &error_handle );
            if(WICED_BT_GATT_SUCCESS != gatt_status)
            {
               wiced_bt_gatt_server_send_error_rsp(p_attr_req->conn_id,
                    p_attr_req->opcode, error_handle, gatt_status);
            }
            break;

        case GATT_GET_RESPONSE_BUFFER_EVT:
            /* GATT buffer request, typically sized to max of bearer mtu - 1 */
            p_event_data->buffer_request.buffer.p_app_rsp_buffer =
            app_alloc_buffer(p_event_data->buffer_request.len_requested);
            p_event_data->buffer_request.buffer.p_app_ctxt =
                    (void *)app_free_buffer;
            gatt_status = WICED_BT_GATT_SUCCESS;
            break;

        case GATT_APP_BUFFER_TRANSMITTED_EVT:
            /* GATT buffer transmitted event,
             * check \ref wiced_bt_gatt_buffer_transmitted_t
             */
            {
            pfn_free_buffer_t pfn_free = (pfn_free_buffer_t)p_event_data
                    ->buffer_xmitted.p_app_ctxt;

            /* If the buffer is dynamic, the context will point to a
             * function to free it.
             */
            if (pfn_free)
            {
                pfn_free(p_event_data->buffer_xmitted.p_app_data);
            }
            gatt_status = WICED_BT_GATT_SUCCESS;
            }
            break;
        default:
            gatt_status = WICED_BT_GATT_ERROR;
               break;
    }

    return gatt_status;
}

/*******************************************************************************
* Function Name: le_app_init
********************************************************************************
* Summary:
*  This function handles application level initialization tasks and is called
*  from the BT management callback once the LE stack enabled event
*  (BTM_ENABLED_EVT) is triggered.
*  This function is executed in the BTM_ENABLED_EVT management callback.
*******************************************************************************/

static void le_app_init(void)
{

#if (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP)

    /* SysPm callback registration for PWMs */
    Cy_SysPm_RegisterCallback(&PWM1DeepSleepCallbackHandler);
    Cy_SysPm_RegisterCallback(&PWM2DeepSleepCallbackHandler);

#endif

    cy_rslt_t cy_result = CY_RSLT_SUCCESS;
    cy_rslt_t result = CY_TCPWM_SUCCESS;
    wiced_result_t wiced_result = WICED_BT_SUCCESS;
    wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_SUCCESS;
    printf("\n***********************************************\n");
    printf("**Discover device with \"Find Me Target\" name*\n");
    printf("***********************************************\n\n");

    /* Initialize the PWM used for USER LEDs */

    /* LED 1 */
    /* Initialize the TCPWM block */
    result = Cy_TCPWM_PWM_Init(CYBSP_PWM_LED_CTRL_2_HW,
            CYBSP_PWM_LED_CTRL_2_NUM,
            &CYBSP_PWM_LED_CTRL_2_config);

    /* PWM init failed. Stop program execution */
    if(CY_TCPWM_SUCCESS != result)
    {
        printf("Failed to initialize PWM for LED1.\r\n");
        handle_app_error();
    }

    /* Enable the TCPWM block */
    Cy_TCPWM_PWM_Enable(CYBSP_PWM_LED_CTRL_2_HW,
            CYBSP_PWM_LED_CTRL_2_NUM);

    /* Start the PWM */
    Cy_TCPWM_TriggerStart_Single(CYBSP_PWM_LED_CTRL_2_HW,
            CYBSP_PWM_LED_CTRL_2_NUM);

    /* LED 2 */
    /* Initialize the TCPWM block */
    result = Cy_TCPWM_PWM_Init(CYBSP_PWM_LED_CTRL_1_HW,
            CYBSP_PWM_LED_CTRL_1_NUM,
            &CYBSP_PWM_LED_CTRL_1_config);

    /* PWM init failed. Stop program execution */
    if(CY_TCPWM_SUCCESS != result)
    {
        printf("Failed to initialize PWM for LED2.\r\n");
        handle_app_error();
    }

    /* Enable the TCPWM block */
    Cy_TCPWM_PWM_Enable(CYBSP_PWM_LED_CTRL_1_HW,
            CYBSP_PWM_LED_CTRL_1_NUM);

    /* Start the PWM */
    Cy_TCPWM_TriggerStart_Single(CYBSP_PWM_LED_CTRL_1_HW,
            CYBSP_PWM_LED_CTRL_1_NUM);
    wiced_bt_set_pairable_mode(FALSE, FALSE);

    /* Set Advertisement Data */
    cy_result= wiced_bt_ble_set_raw_advertisement_data
            (CY_BT_ADV_PACKET_DATA_SIZE, cy_bt_adv_packet_data);
    if (WICED_SUCCESS != cy_result)
    {
        printf("Set ADV data failed\n");
    }

    /* Set raw response packet data */
    cy_result=wiced_bt_ble_set_raw_scan_response_data
            (SCAN_RESPONSE_NO_OF_ELEMENTS,cy_bt_scan_resp_packet_data);
    if (WICED_SUCCESS != cy_result)
    {
        printf("Set response data failed\n");
    }
    /* Register with BT stack to receive GATT callback */
    gatt_status = wiced_bt_gatt_register(le_app_gatt_event_callback);
    printf("GATT event Handler registration status: %s \n",
            get_bt_gatt_status_name(gatt_status));

    /* Initialize GATT Database */
    gatt_status = wiced_bt_gatt_db_init(gatt_database,
            gatt_database_len, NULL);
    printf("GATT database initialization status: %s \n",
            get_bt_gatt_status_name(gatt_status));

    /* Start Undirected LE Advertisements on device startup. */
    wiced_result = wiced_bt_start_advertisements
            (BTM_BLE_ADVERT_UNDIRECTED_HIGH, BLE_ADDR_PUBLIC, NULL);

    /* Failed to start advertisement. Stop program execution */
    if (WICED_BT_SUCCESS != wiced_result)
    {
        printf("failed to start advertisement! \n");
        handle_app_error();
    }
}

