Infineon/mtb-example-psoc-edge-btstack-findme/proj_cm33_ns/source/main.c
    /* LPTimer setup failed. Stop program execution. */
    if(CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

   /* Pass the LPTimer object to abstraction RTOS library that implements
    * tickless idle mode
    */
    cyabs_rtos_set_lptimer(&lptimer_obj);
}

/*******************************************************************************
* Function Name: setup_clib_support
********************************************************************************
* Summary:
*    1. This function configures and initializes the Real-Time Clock (RTC).
*    2. It then initializes the RTC HAL object to enable CLIB support library
*       to work with the provided Real-Time Clock (RTC) module.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void setup_clib_support(void)
{
    /* RTC Initialization */
    Cy_RTC_Init(&CYBSP_RTC_config);
    Cy_RTC_SetDateAndTime(&CYBSP_RTC_config);

    /* Initialize the ModusToolbox CLIB support library */
    mtb_clib_support_init(&rtc_obj);
}

/*******************************************************************************
* Function Name : main
********************************************************************************
* Summary:
*  Entry point to the application. Set device configuration and start
*  BT stack initialization.  The actual application initialization will happen
*  when stack reports that BT device is ready.
*******************************************************************************/
int main(void)
{
    cy_rslt_t cy_result;
    wiced_result_t wiced_result;

    /* Initialize the board support package */
    cy_result = cybsp_init();
    if (CY_RSLT_SUCCESS != cy_result)
    {
        handle_app_error();
    }

    /* Initialize retarget-io middleware */
    init_retarget_io();

    /* Setup CLIB support library. */
    setup_clib_support();

    /* Setup the LPTimer instance for CM33 CPU. */
    setup_tickless_idle_timer();

    /* Clear UART Terminal Window*/
    printf("\x1b[2J\x1b[;H");
    /* Display header information*/
    printf("************* PSOC Edge MCU : Bluetooth LE Findme "
            "Profile **************\n\n");

    /* Enable global interrupts */
    __enable_irq();
    
    /* Initialize BT Stack */
    wiced_result = wiced_bt_stack_init (app_bt_management_callback,
               &cy_bt_cfg_settings);

    /* Check if stack initialization was successful */
    if( WICED_BT_SUCCESS == wiced_result)
    {
        printf("Bluetooth Stack Initialization Successful \n");
        printf("Wait few seconds... Patch is getting downloaded. \n");
    }
    else
    {
        printf("Bluetooth Stack Initialization failed!! \n");
        handle_app_error();
    }

   /* Enable CM55. CM55_APP_BOOT_ADDR must be updated if CM55
    * memory layout is changed.
    */
    Cy_SysEnableCM55( MXCM55,CM55_APP_BOOT_ADDR,
           CM55_BOOT_WAIT_TIME_USEC);

    /* Start the FreeRTOS scheduler */
    vTaskStartScheduler();

    /* Should never get here */
    handle_app_error();
}


/* END OF FILE [] */
